Repository: 84000/data-translation-memory
Catalog: toh503_84000-the-detailed-account-of-the-previous-aspirations-of-the-seven-thus-gone-ones.tmx
Source language: bo
Languages: en

source: །འཇམ་དཔལ་གཞན་ཡང་དད་པའི་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་དག་ཇི་སྲིད་འཚོའི་བར་དུ་གསུམ་ལ་སྐྱབས་སུ་འཛིན་ཅིང་ལྷ་གཞན་མི་འཛིན་པ་དང་། གང་དག་ཡང་བསླབ་པའི་གཞི་ལྔ་པོ་དག་འཛིན་པ་དང་། གང་དག་བསླབ་པའི་གཞི་བཅུ་པོ་དག་འཛིན་པ་དང་། གང་དག་བྱང་ཆུབ་སེམས་དཔའི་སྡོམ་པ་བསླབ་པའི་གཞི་བཞི་བརྒྱ་པོ་དག་འཛིན་པ་དང་། ཁྱིམ་གྱི་གནས་ནས་བྱུང་བའི་དགེ་སློང་གང་དག་བསླབ་པའི་གཞི་ཉིས་བརྒྱ་ལྔ་བཅུ་པོ་དག་འཛིན་པ་དང་། དགེ་སློང་མ་གང་དག་བསླབ་པའི་གཞི་ལྔ་བརྒྱ་པོ་དག་འཛིན་པ་དང་། གང་དག་ཇི་ལྟར་ཡོངས་སུ་བཟུང་བའི་བསླབ་པའི་སྡོམ་པ་དེ་དག་གི་ནང་ནས་བསླབ་པའི་གཞི་གང་ཡང་རུང་བ་ཞིག་ལས་ཉམས་པར་གྱུར་ཏེ། ངན་འགྲོ་ངན་སོང་གིས་འཇིགས་སྐྲག་པ་གང་དག་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་དེ་ལ་མཆོད་པ་རྣམ་པ་སྣ་ཚོགས་བྱེད་ན། དེ་དག་ལ་ངན་སོང་གསུམ་གྱི་སྡུག་བསྔལ་མེད་པར་ཤེས་པར་བྱའོ། །བུད་མེད་གང་ལ་ལ་བུ་བཙའ་བའི་དུས་ན།
en: “Moreover, Mañjuśrī, if any faithful sons or daughters of good family who maintain taking refuge in the Three Jewels for as long as they live and have no other tutelary deity, maintain the five precepts, maintain the ten precepts, maintain the four hundred vows and precepts of a bodhisattva, are monks who have left home and maintain the two hundred and fifty precepts, or are nuns who maintain the five hundred precepts, should break any one of the precepts among the vows and precepts they have taken and are anxious and afraid of falling into the lower realms and then make offerings to the blessed Thus-Gone Bhaiṣajya­guru­vaiḍūrya­prabha, they should know that they will not suffer rebirth in the three lower realms.

source: སྡུག་བསྔལ་མ་རུངས་པ་དྲག་པོ་མི་བཟད་པ་མྱོང་བ་དེས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་དེ་ལ་མཆོད་ན་དེ་མྱུར་དུ་ཡོངས་སུ་ཐར་བར་འགྱུར།
en: “If any woman giving birth who experiences intense, fierce, and unbearable suffering makes offerings to the blessed Thus-Gone Bhaiṣajya­guru­vaiḍūrya­prabha, she will immediately be liberated from that suffering.

source: བུ་ཡང་ཡན་ལག་ཡོངས་སུ་ཚང་བར་བཙའ་ཞིང་གཟུགས་བཟང་བ་དང་། མཛེས་པ་དང་། བལྟ་ན་སྡུག་པ་དང་། དབང་པོ་རྣོ་བ་དང་། བློ་དང་ལྡན་པ་དང་། ནད་མེད་ཅིང་གནོད་པ་ཉུང་བར་འགྱུར་ཏེ།
en: The child will be born with all its limbs intact, and it will have a good physique, be handsome, good looking, have sharp faculties, be intelligent, healthy, and have few difficulties.

source: དེ་ལ་མི་མ་ཡིན་པས་མདངས་འཕྲོགས་པར་མི་ནུས་སོ།
en: Nonhuman beings will not be able to steal its vital energy.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་གང་གི་ཕྱི་རང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་ཀྱི་རྒྱལ་པོ་དེའི་ཡོན་ཏན་བརྗོད་པར་ཁྱོད་དད་དམ་ཡིད་ཆེས་སམ།
en: At that point the Blessed One asked venerable Ānanda, “Ānanda, do you trust and believe in the good qualities of the blessed Thus-Gone Bhaiṣajya­guru­vaiḍūrya­prabharāja that I have described?

source: ཡང་ན་ཁྱོད་སངས་རྒྱས་ཀྱི་སྤྱོད་ཡུལ་ཟབ་མོ་འདི་ལ་ཡིད་གཉིས་སམ། སོམ་ཉིའམ། ཐེ་ཙོམ་ཟ་བ་མེད་དམ།
en: Are you uncertain, or do you have any reservations or doubts about this profound buddha domain?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་དེ་བཞིན་གཤེགས་པས་གསུངས་བའི་ཆོས་རྣམས་ལ་ཡིད་གཉིས་སམ། སོམ་ཉིའམ། ཐེ་ཙོམ་འཚལ་བ་མ་མཆིས་སོ། །དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་སྐུ་དང་། གསུང་དང་། ཐུགས་ཀྱི་ཀུན་དུ་སྤྱོད་པ་ཡོངས་སུ་མ་དག་པ་མི་མངའ་བའི་སླད་དུའོ།
en: “Respected Blessed One,” venerable Ānanda replied, “I am not uncertain, nor do I have any reservations or doubts about the qualities that the Thus-Gone One has described, because the thus-gone ones have no impure conduct of body, speech, and mind.

source: །བཅོམ་ལྡན་འདས་གདུགས་དང་། དགུང་ཟླ་འདི་ལྟར་རྫུ་འཕྲུལ་ཆེ་ཞིང་འདི་ལྟར་མཐུ་ཆེ་བ་འདི་གཉིས་ནི་དོགས་ལ་ལྟུང་ཡང་གདའ། རིའི་རྒྱལ་པོ་རི་རབ་ནི་གནས་ནས་འཕོ་ཡང་གདའི། སངས་རྒྱས་རྣམས་ཀྱི་བཀའ་ནི་གཞན་དུ་མི་འགྱུར་ལགས་སོ།
en: Blessed One, even such miraculous and powerful beings as the sun and the moon might fall to the earth, and even Sumeru, the king of mountains, might move from its base, but the word of the buddhas is never incorrect.

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་ལྟ་ལགས་ཀྱིས་ཀྱང་སེམས་ཅན་དད་པའི་དབང་པོ་དང་བྲལ་བདག་མཆིས་ཏེ། སངས་རྒྱས་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་སྤྱོད་ཡུལ་འདི་ཐོས་ན་དེ་དག་འདི་སྙམ་དུ་སེམས་པར་འགྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་འདི་དྲན་པ་ཙམ་གྱིས་ཇི་ལྟར་ཤིན་ཏུ་ཡོན་ཏན་དང་ཕན་ཡོན་དུ་འགྱུར་སྙམ་ནས། དེ་དག་མི་དད་ཅིང་ཡིད་མི་ཆེས་ཏེ་སྤོང་བས་ཡུན་རིང་པོར་གནོད་པ་དང་། མི་སྨན་པ་དང་། མི་བདེ་བ་དང་། ལོག་པར་ལྟུང་བར་འགྱུར་རོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Yet still, respected Blessed One, there are beings who lack the capacity for faith, and when they hear about this buddha domain of the buddhas, they will wonder ‘How can such good qualities and benefits come about by merely recollecting the name of that thus-gone one?’ Because they have no faith, do not believe, and reject this, for a long time they will suffer injuries, lack medicines, be unhappy, and fall into the lower realms.”

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་སུའི་རྣ་ལམ་དུ་གྲག་པར་གྱུར་པ་དེ་ངན་འགྲོ་ངན་སོང་དུ་འགྲོ་བར་འགྱུར་བ་ནི་གནས་མེད་དེ་གོ་སྐབས་མ་ཡིན་ནོ།
en: The Blessed One replied, “Ānanda, it is untenable and impossible for someone who has had the name of that thus-gone one resound in their ear to be reborn in the lower realms.

source: །ཀུན་དགའ་བོ་སངས་རྒྱས་རྣམས་ཀྱི་སྤྱོད་ཡུལ་ནི་ཡིད་ཆེས་པར་དཀའ་བའོ།
en: Ānanda, the domain of the buddhas is difficult to believe.

source: །ཀུན་དགའ་བོ་ཁྱོད་དད་ཅིང་ཡིད་ཆེས་པ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་མཐུ་ཡིན་པར་བལྟའོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་རྣམས་མ་གཏོགས་པར་འདི་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་མ་ཡིན་ནོ།
en: Ānanda, the faith and belief you have should be seen as the power of the Thus-Gone One. This is something that only bodhisattva great beings who are one birth away from awakening possess—not hearers and solitary buddhas.

source: །ཀུན་དགའ་བོ་མིར་འགྱུར་བ་རྙེད་པ་ནི་རྙེད་པར་དཀའོ། །དཀོན་མཆོག་གསུམ་ལ་དད་ཅིང་གུས་པ་ཡང་རྙེད་པར་དཀའོ། །དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་ཐོས་པ་ཡང་རྙེད་པར་ཤིན་ཏུ་དཀའོ།
en: “Ānanda, attaining a human life is rare, and faith and devotion toward the Three Jewels is rare, but hearing the name of that thus-gone one is even more rare.

source: །ཀུན་དགའ་བོ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་དེའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ནི་ཚད་མེད་དོ། །ཐབས་ལ་མཁས་པ་ཡང་ཚད་མེད་དོ། །སྨོན་ལམ་གྱི་ཁྱད་པར་རྒྱས་པ་ཡང་ཚད་མེད་དོ།
en: Ānanda, the bodhisattva conduct of the blessed Thus-Gone Bhaiṣajya­guru­vaiḍūrya­prabha is immeasurable, his skillful means is immeasurable, and the detailed account of his aspirations is immeasurable.

source: །ང་དེ་བཞིན་གཤེགས་པ་དེའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་བསྐལ་པའམ། བསྐལ་པ་ལས་ལྷག་པར་རྒྱ་ཆེར་ཡང་དག་པར་བཤད་པར་འདོད་ཀྱང་བསྐལ་པ་ཟད་པར་འགྱུར་གྱི། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་ཀྱི་རྒྱལ་པོ་དེའི་སྔོན་གྱི་སྨོན་ལམ་གྱི་ཁྱད་པར་རྒྱས་པའི་མཐའ་རྟོགས་པར་མི་འགྱུར་རོ།
en: If I wanted to explain that thus-gone one’s bodhisattva conduct accurately and extensively for an eon or the remainder of an eon, the eon would come to an end before I could complete that detailed account of the blessed Thus-Gone Bhaiṣajya­guru­vaiḍūrya­prabharāja’s previous aspirations.”

source: །ཡང་དེའི་ཚེ་འཁོར་དེའི་ནང་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྐྱབས་གྲོལ་ཞེས་བྱ་བ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་སླད་མའི་ཚེ་སླད་མའི་དུས་ན་སེམས་ཅན་བྲོ་ནད་སྣ་ཚོགས་ཀྱིས་ལུས་ཡོངས་སུ་གཟིར་ཏེ།
en: At that point, from among the gathering a bodhisattva great being named Trāṇamukta rose from his seat, adjusted his upper robe on one shoulder, knelt with his right knee on the ground, bowed to the Blessed One with his palms together, and said to the Blessed One, “Respected Blessed One, in the future there will be beings whose bodies are tormented by various types of illnesses.

source: ཡུན་རིང་པོའི་བྲོ་ནད་ཀྱིས་ལུས་ཀྱི་ཤབས་ཤིང་། བཀྲེས་པ་དང་། སྐོམ་པས་གྲེ་བ་དང་མཆུ་ནི་སྐམས།
en: Their limbs will atrophy due to chronic illness and their lips and throats will be parched from hunger and thirst.

source: འགུམ་པ་ལ་ནི་མངོན་དུ་ཕྱོགས། མཛའ་བཤེས་དང་། ཉེ་དུ་དང་། སྣག་གི་གཉེན་མཚམས་ངུ་བ་རྣམས་ཀྱིས་ནི་བསྐོར།
en: They will be heading for their demise surrounded by weeping friends, acquaintances, and relatives.

source: ཕྱོགས་རྣམས་ནི་མུན་པར་མཐོང་། གཤིན་རྗེའི་མི་རྣམས་ཀྱིས་ནི་དྲངས་ཏེ།
en: They will see darkness in all directions and be led by Yama’s servants.

source: དེའི་ལུས་འདི་ན་ཉལ་ཡང་རྣམ་པར་ཤེས་པ་ཆོས་ཀྱི་རྒྱལ་པོ་གཤིན་རྗེའི་མདུན་དུ་ཁྲིད་ཅིང་།
en: “While such a person’s body is still lying there, the consciousness will be brought before the Dharma King Yama.

source: མི་དེ་དང་ལྷན་ཅིག་སྐྱེས་པའི་ལྷ་སླད་བཞིན་འབྲང་བ་གང་ལགས་པ་དེས་ནི་དེས་དགེ་བའམ། མི་དགེ་བའི་ལས་བགྱིས་པ་དེ་ཐམས་ཅད་ལེགས་པར་ཡི་གེར་བྲིས་ནས་ཆོས་ཀྱི་རྒྱལ་པོ་གཤིན་རྗེ་ལ་ཕུལ་བ་དང་། ཆོས་ཀྱི་རྒྱལ་པོ་གཤིན་རྗེས་དེ་ལ་དྲིས་ཤིང་བརྟགས་ནས་དགེ་བའམ། མི་དགེ་བ་ཇི་ལྟར་བགྱིས་པ་དེ་བཞིན་དུ་བསྒོ་བ་ལ།
en: The god who was born with that person and who has recorded all of that person’s virtuous and nonvirtuous actions in writing will then present them to the Dharma King Yama. The Dharma King Yama will then question and interrogate the person and issue his judgment based on how many of their actions were virtuous or nonvirtuous.

source: གང་དག་ནད་པ་དེའི་དོན་དུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་ཀྱི་རྒྱལ་པོ་དེ་ལ་སྐྱབས་སུ་མཆིས་ཞིང་འདི་འདྲ་བའི་སྦྱོར་བས་མཆོད་པ་བགྱིད་ན། དེའི་རྣམ་པར་ཤེས་པ་སླར་ལྡོག་ཅིང་རྨི་ལམ་རྨིས་པ་བཞིན་དུ་བདག་ཉིད་ཀྱིས་འཚལ་བའི་གནས་དེར་མཆིས་ཏེ།
en: “If the friends, acquaintances, and relatives of those who are ill take refuge in the blessed Thus-Gone Bhaiṣajya­guru­vaiḍūrya­prabharāja and perform the offering in this way to benefit them, their consciousness will turn back and make its way, just as if they had been dreaming, to the place where they had been.

source: ཡང་ན་ནི་གདུགས་བདུན། ཡང་ན་ནི་གདུགས་ཉི་ཤུ་རྩ་གཅིག །ཡང་ན་ནི་གདུགས་སུམ་ཅུ་རྩ་ལྔ། ཡང་ན་ནི་གདུགས་བཞི་བཅུ་རྩ་དགུ་ལ་དེའི་རྣམ་པར་ཤེས་པ་སླར་ལྡོག་ཅིང་དྲན་པ་རྙེད་ལ།
en: For some the consciousness will return on the seventh day, for some on the twenty-first, thirty-fifth, or forty-ninth day, and they will remember what happened to them.

source: དེ་ལ་དགེ་བ་དང་། མི་དགེ་བའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་བདག་ཉིད་ཀྱི་མངོན་སུམ་དུ་འགྱུར་ཏེ། སྲོག་གི་སླད་དུ་ཡང་སྡིག་པའི་ལས་མི་བགྱིད་དོ།
en: The ripening of virtuous and nonvirtuous actions will now be clear to them, and they will no longer commit unwholesome actions, even at the expense of their life.

source: །དེ་ལྟ་ལགས་པས་དད་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་མཆོད་པར་བགྱིའོ།
en: Therefore, faithful sons or daughters of good family should make offerings to that thus-gone one.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བྱང་ཆུབ་སེམས་དཔའ་སྐྱབས་གྲོལ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་ཀྱི་རྒྱལ་པོ་དེ་ལ་ཇི་ལྟར་མཆོད་པར་བྱ།
en: Venerable Ānanda then asked the bodhisattva Trāṇamukta, “Son of good family, how should one perform such an offering to the blessed Thus-Gone Bhaiṣajya­guru­vaiḍūrya­prabharāja?”

source: བྱང་ཆུབ་སེམས་དཔའ་སྐྱབས་གྲོལ་གྱིས་སྨྲས་པ། བཙུན་པ་ཀུན་དགའ་བོ་གང་དག་ནད་ཆེན་པོ་ལས་ཡོངས་སུ་ཐར་བར་འདོད་པ་དེ་དག་གིས་ནད་པ་དེའི་དོན་དུ་ཉིན་ལན་བདུན་མཚན་ལན་བདུན་དུ་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་གསོ་སྦྱོང་གི་སྡོམ་པ་བླང་བར་བྱའོ།
en: The bodhisattva Trāṇamukta replied, “Venerable Ānanda, those who want to free someone from a grave illness should observe the eightfold purification vows for seven days and seven nights to benefit the sick person.

source: །དགེ་སློང་གི་དགེ་འདུན་ལ་ཟས་དང་། སྐོམ་རྣམས་དང་། ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་ཅི་ནུས་སུ་མཆོད་པ་དང་། རིམ་གྲོ་བྱའོ།
en: They should make as many offerings as possible to the monastic saṅgha of food, drink, and provisions, and offer service.

source: །ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་དུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་ཀྱི་རྒྱལ་པོ་དེའི་མཚན་ཡིད་ལ་བྱའོ།
en: They should focus on the name of the blessed Thus-Gone Bhaiṣajya­guru­vaiḍūrya­prabharāja three times each day and three times each night.

source: །མདོ་འདི་ལན་བཞི་བཅུ་རྩ་དགུ་གདོན་པར་བྱའོ། །ཞག་བཞི་བཅུ་རྩ་དགུར་མར་མེ་བུད་པར་བྱའོ། །སྐུ་གཟུགས་བདུན་བྱའོ།
en: They should recite this discourse forty-nine times, offer oil lamps for forty-nine days, and make seven statues.

source: །སྐུ་གཟུགས་རེ་རེའི་སྤྱན་སྔར་ཡང་མར་མེ་བདུན་བདུན་བཞག་གོ། །མར་མེ་རེ་རེའི་ཚད་ཀྱང་ཤིང་རྟའི་འཕང་ལོ་ཙམ་དུ་བྱ་སྟེ། ཅི་ནས་ཀྱང་ཞག་བཞི་བཅུ་རྩ་དགུར་མར་མེ་མི་ཟད་པར་བྱའོ།
en: They should place seven oil lamps in front of each statue, and each of the oil lamps should be as large as a chariot wheel to ensure that the oil lamps will not go out during the forty-nine days.

source: །ཚོན་སྣ་ལྔ་པའི་བ་དན་བཞི་བཅུ་རྩ་དགུ་ལས་ལྷག་པར་བྱའོ། །བཙུན་པ་ཀུན་དགའ་བོ་གཞན་ཡང་རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བ་རྣམས་ལ་ནད་ཀྱི་གནོད་པ་འམ། རང་གི་དམག་ཚོགས་སམ། ཕ་རོལ་གྱི་དམག་ཚོགས་ཀྱི་གནོད་པ་འམ། རྒྱུ་སྐར་གྱི་གནོད་པའམ། གཟའ་ཟླ་བའི་གནོད་པའམ།
en: They should make more than forty-nine five-colored flags.

source: གཟའ་ཉི་མའི་གནོད་པའམ། དུས་མ་ཡིན་པའི་རླུང་དང་། ཆར་གྱི་གནོད་པའམ། ཐན་པའི་གནོད་པ་ཡང་རུང་སྟེ། གནོད་པ་དང་། ནད་འགོ་བ་དང་། འཁྲུག་པ་ཞིག་ཉེ་བར་གནས་པར་གྱུར་ན། རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བ་དེས་སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པའི་སེམས་སུ་བྱ།
en: “Respected Ānanda, if anointed kṣatriya kings face a threat of injury, disaster, and conflict that is related to an illness, their own or an enemy army, a lunar asterism, a lunar eclipse, a solar eclipse, unseasonable winds and rains, and drought, then those anointed kṣatriya kings should be benevolent toward all beings.

source: བཙོན་དུ་བཟུང་བ་རྣམས་གཏང་བར་བྱ་ཞིང་གོང་དུ་སྨོས་པ་བཞིན་དུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་ཀྱི་རྒྱལ་པོ་དེ་ལ་དེ་ལྟ་བུར་མཆོད་པར་བྱས་ན། རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བ་དེའི་དགེ་བའི་རྩ་བ་དེ་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་ཀྱི་རྒྱལ་པོ་དེའི་སྔོན་གྱི་སྨོན་ལམ་གྱི་ཁྱད་པར་གྱིས་ཡུལ་བདེ་བ་དང་། ལོ་ལེགས་པར་འགྱུར། རླུང་དང་། ཆར་དུས་སུ་ལྡང་ཞིང་ལོ་ཏོག་འགྲུབ་པར་འགྱུར།
en: If they release their prisoners and perform the aforementioned offering to the blessed Thus-Gone Bhaiṣajya­guru­vaiḍūrya­prabharāja, the roots of virtue of those anointed kṣatriya kings and this detailed account of the previous aspiration prayers of the blessed Thus-Gone Bhaiṣajya­guru­vaiḍūrya­prabharāja will ensure that the country will be happy, crops will be good, the winds and rains will come on time, and there will be a successful harvest.

source: ཡུལ་དེ་ན་གནས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱང་ནད་མེད་པ་དང་། བདེ་བ་དང་། མཆོག་ཏུ་དགའ་བ་མང་བར་འགྱུར་རོ།
en: All the beings who live in that country will be healthy and happy and will abound in supreme joy.

source: །ཡུལ་དེར་གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། འབྱུང་པོ་དང་། ཤ་ཟ་མ་རུངས་པས་སེམས་ཅན་རྣམས་ལ་གཙེ་བར་མི་འགྱུར་རོ།
en: The wicked yakṣas, rākṣasas, bhūtas, and piśācas in that country will not harm beings.

source: །ལྟས་ངན་པ་ཐམས་ཅད་མཐོང་བར་མི་འགྱུར་རོ། །རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བ་དེའི་ཚེ་དང་། མདོག་དང་། སྟོབས་དང་། ནད་མེད་པ་དང་། དབང་ཕྱུག་རྣམས་མངོན་པར་འཕེལ་བར་འགྱུར་རོ།
en: No evil omens will appear, and the lifespans, complexions, energy, health, and power of those anointed kṣatriya kings will increase.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བྱང་ཆུབ་སེམས་དཔའ་སྐྱབས་གྲོལ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཇི་ལྟར་ན་ཚེ་ཡོངས་སུ་ཟད་ནས་ཡང་མངོན་པར་སྐྱེ།
en: Then venerable Ānanda asked the bodhisattva Trāṇamukta, “Son of good family, how is it that someone’s lifespan may be restored after it has been exhausted?”

source: བྱང་ཆུབ་སེམས་དཔའ་སྐྱབས་གྲོལ་གྱིས་སྨྲས་པ། བཙུན་པ་ཀུན་དགའ་བོ་དུས་མ་ཡིན་པར་འཆི་བ་དགུ་ཡོད་པར་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལས་མ་ཐོས་སམ།
en: “Respected Ānanda,” the bodhisattva Trāṇamukta replied, “have you not heard from the Thus-Gone One that premature death may be of nine types?

source: དེའི་ཕྱིར་སྔགས་དང་སྨན་གྱི་སྦྱོར་བ་རྣམས་བསྟན་ཏོ།
en: It is for this reason that he has taught the use of mantras and medicines?

source: །སེམས་ཅན་ནད་ཀྱིས་བཏབ་ལ་དེ་ནད་ཚབས་མི་ཆེས་ཀྱང་སྨན་དང་། རིམ་གྲོ་བྱེད་པ་དང་མི་ལྡན་ནམ། ཡང་ན་སྨན་པ་སྨན་མ་ཡིན་པ་བྱེད་པ་ཡང་ཡོད་དེ་འདི་ནི་དུས་མ་ཡིན་པར་འཆི་བ་དང་པོའོ།
en: There are beings who contract an illness, and even though that illness is not very severe, they either lack both medicine and nurses or the doctors administer the wrong medicine. This is the first type of untimely death.

source: །དུས་མ་ཡིན་པར་འཆི་བ་གཉིས་པ་ནི་གང་རྒྱལ་པོའི་ཆད་པས་འཆི་བའི་དུས་བྱེད་པའོ།
en: The second type of untimely death is when someone is executed as a king’s punishment.

source: །དུས་མ་ཡིན་པར་འཆི་བ་གསུམ་པ་ནི་གང་དག་ཧ་ཅང་བག་མེད་དེ། བག་མེད་པར་གནས་པ་དེ་དག་ལ་མི་མ་ཡིན་པ་དག་གིས་མདངས་འཕྲོག་པའོ།
en: The third type of untimely death is when someone is extremely careless, for nonhuman beings steal the vital energy from those who live carelessly.

source: །དུས་མ་ཡིན་པར་འཆི་བ་བཞི་པ་ནི་གང་དག་མེས་ཚིག་སྟེ་འཆི་བའི་དུས་བྱེད་པའོ།
en: The fourth type of untimely death is when someone is burned by fire and dies.

source: །དུས་མ་ཡིན་པར་འཆི་བ་ལྔ་པ་ནི་གང་དག་ཆུས་འཆི་བའོ།
en: The fifth type of untimely death is when someone dies by drowning.

source: །དུས་མ་ཡིན་པར་འཆི་བ་དྲུག་པ་ནི་གང་དག་སེང་གེ་དང་། སྟག་དང་། ཝ་དང་། སྦྲུལ་དང་། གཅན་གཟན་ཁྲོ་བོའི་ནང་དུ་ཆུད་དེ་འཆི་བའོ།
en: The sixth type of untimely death is when someone dies upon encountering a ferocious predator such as a lion, tiger, jackal, or snake.

source: །དུས་མ་ཡིན་པར་འཆི་བ་བདུན་པ་ནི་གང་དག་རི་ཀ་ནས་གཡང་དུ་ལྷུང་བའོ།
en: The seventh type of untimely death is when someone falls off a mountainside into an abyss.

source: །དུས་མ་ཡིན་པར་འཆི་བ་བརྒྱད་པ་ནི་གང་དག་དུག་དང་། བྱད་སྟེམས་དང་། རོ་ལངས་ཀྱི་སྦྱོར་བས་གསོད་པའོ།
en: The eighth type of untimely death is when someone is killed by poison, a kākhorda, or a vetāla.

source: །དུས་མ་ཡིན་པར་འཆི་བ་དགུ་པ་ནི་གང་དག་ཟས་དང་སྐོམ་མ་རྙེད་ནས་བཀྲེས་པ་དང་། སྐོམ་པས་ཉེན་ཏེ་འཆི་བའི་དུས་བྱེད་པའོ།
en: The ninth type of untimely death is when someone cannot find food and drink and dies of hunger and thirst.

source: །མདོར་ན་འདི་དག་ནི་དེ་བཞིན་གཤེགས་པས་དུས་མ་ཡིན་པར་འཆི་བ་ཆེན་པོར་བསྟན་པ་སྟེ། གཞན་ཡང་དུས་མ་ཡིན་པར་འཆི་བ་ནི་གྲངས་མེད་དཔག་ཏུ་མེད་དོ།
en: This is a brief account of the types of untimely death that the Thus-Gone One has taught, but there are an innumerable and incalculable number of other kinds of untimely death.”

source: །དེ་ནས་འཁོར་དེར་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་བཅུ་གཉིས་འདུས་པར་གྱུར་ཏེ། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཅི་འཇིགས་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་རྡོ་རྗེ་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་རྒྱན་འཛིན་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་གཟའ་འཛིན་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་རླུང་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་གནས་བཅས་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་དབང་འཛིན་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་བཏུང་འཛིན་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་སྨྲ་འཛིན་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་བསམ་འཛིན་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་གཡོ་བ་འཛིན་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་རྫོགས་བྱེད་དེ། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་བཅུ་གཉིས་པོ་དེ་དག་གོ།
en: There were twelve great yakṣa generals gathered in that assembly—the great yakṣa general Kiṃbhīra, the great yakṣa general Vajra, the great yakṣa general Mekhila, the great yakṣa general Antila, the great yakṣa general Anila, the great yakṣa general Saṇṭhila, the great yakṣa general Indala, the great yakṣa general Pāyila, the great yakṣa general Mahāla, the great yakṣa general Cidāla, the great yakṣa general Caundhula, and the great yakṣa general Vikala.

source: །གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་རེ་རེ་ལ་ཡང་གཡོག་གནོད་སྦྱིན་བདུན་འབུམ་བདུན་འབུམ་ཡོད་པ་སྟེ། དེ་དག་གིས་ཚིག་གཅིག་ཏུ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་མཐུས་བདག་ཅག་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་ཀྱི་རྒྱལ་པོ་དེའི་མཚན་ཐོས་ཏེ། བདག་ཅག་ལ་ཡང་ངན་འགྲོར་མཆི་བའི་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར་རོ།
en: Each great yakṣa general had seven hundred thousand yakṣa attendants, and they all told the Blessed One with a single voice, “Blessed One, due to the Buddha’s power, we have heard the name of the blessed Thus-Gone Bhaiṣajya­guru­vaiḍūrya­prabharāja, and we will no longer have any fear of proceeding to the lower realms.

source: །དེས་ན་བདག་ཅག་ལྷན་ཅིག་ཏུ་མཐུན་པར་ཇི་སྲིད་འཚོའི་བར་དུ་སངས་རྒྱས་ལ་སྐྱབས་སུ་མཆིའོ། །ཆོས་ལ་སྐྱབས་སུ་མཆིའོ། །དགེ་འདུན་ལ་སྐྱབས་སུ་མཆིའོ།
en: All of us together, for as long as we live, take refuge in the Buddha, we take refuge in the Dharma, and we take refuge in the Saṅgha.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དང་། སྨན་པ་དང་། བདེ་བའི་སླད་དུ་སྤྲོ་བར་བགྱིའོ།
en: We will diligently work for the benefit, aid, and happiness of all beings.

source: །བྱེ་བྲག་ཏུ་ནི་གྲོང་ངམ། གྲོང་ཁྱེར་རམ། གྲོང་རྡལ་ལམ། དགོན་པའི་གནས་གང་ན་མདོ་སྡེ་འདི་སྤྱོད་པ་དང་། གང་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་ཀྱི་རྒྱལ་པོ་དེའི་མཚན་འཆང་བ་དང་། མཆོད་པ་དང་། རིམ་གྲོ་བགྱིད་པའི་སེམས་ཅན་དེ་དག་ལ་བདག་ཅག་གིས་བསྲུང་བར་བགྱི། ཡོངས་སུ་བསྐྱང་བར་བགྱི།
en: In particular, we will protect any being who practices this sūtra in villages, towns, provinces, and forests, and who remembers the name of the blessed Thus-Gone Bhaiṣajya­guru­vaiḍūrya­prabharāja, makes offerings to him, and serves him.

source: གནོད་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་བགྱི། བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བགྱིའོ།
en: They will be under our protection, they will be under our care, they will be free from all manner of misfortunes, and we will fulfill their every wish.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་དེ་དག་ལ་ལེགས་སོ་ཞེས་བྱ་བ་གནང་སྟེ།
en: “Very good, very good,” the Blessed One said in response to the great yakṣa generals.

source: གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་དག་གང་གི་ཕྱིར་ཁྱོད་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་ཀྱི་རྒྱལ་པོ་དེ་ལ་བྱས་པ་གཟོ་ཞིང་རྗེས་སུ་དྲན་ལ་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པའི་ཕྱིར་ཞུགས་པ་ལེགས་སོ་ལེགས་སོ།
en: “It is excellent that you great yakṣa generals are so grateful toward the blessed Thus-Gone Bhaiṣajya­guru­vaiḍūrya­prabharāja, and that you are so committed to recollecting him and working for the benefit of all beings.”

source: །དེ་ནས་འཁོར་དེའི་ནང་ནས་ལྷའི་བུ་ཤེས་རབ་ཆུང་ངུ་ཁ་ཅིག་འདི་སྙམ་དུ་སེམས་ཏེ། ཇི་ལྟར་ན་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ན་རྣམ་པར་བཞུགས་པའི་དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་མཚན་ཐོས་པ་དང་། བཟུང་བ་ཙམ་གྱིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་གྱི་ཁྱད་པར་འདི་ལྟ་བུར་འགྱུར་སྙམ་མོ།
en: At this point, some of the gods in the assembly who were not very intelligent wondered, “How can beings who simply hear and bear in mind the name of those thus-gone ones, who live past as many buddhafields as there are grains of sand in the Gaṅgā river, develop such special qualities?”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་ལྷའི་བུ་བློ་གྲོས་ཆུང་ངུ་དེ་དག་གི་སེམས་ཀྱི་ཡོངས་སུ་རྟོག་པ་ཐུགས་ཀྱིས་མཁྱེན་ནས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་བསྐུལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ།
en: The blessed Thus-Gone Śākyamuni mentally perceived those unintelligent gods’ confusion and entered into the absorption called invoking the buddhafields of all the thus-gone ones

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཏིང་ངེ་འཛིན་དེ་ལ་མཉམ་པར་གཞག་མ་ཐག་ཏུ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་རབ་ཏུ་གཡོས་སོ། །ལྷའི་ཙནྡན་གྱི་ཕྱེ་མ་དང་། མེ་ཏོག་གི་སྤྲིན་གྱི་ཆར་ཡང་བབ་བོ།
en: As soon as the Blessed One rested in that absorption, the entire trichiliocosm trembled, and a great rain of divine sandalwood powder and flowers fell.

source: །དེ་བཞིན་གཤེགས་པ་བདུན་པོ་དེ་དག་ཀྱང་། འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་གཤེགས་ཏེ། དེ་བཞིན་གཤེགས་པའི་སྔོན་གྱི་དགེ་བའི་རྩ་བ་ལས་བྱུང་བའི་ལྷའི་སེང་གེའི་ཁྲི་ལ་བཞུགས་ཤིང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་ནི་བསྐོར།
en: The seven thus-gone ones themselves came to this Sahā world and appeared along with the blessed Thus-Gone One Śākyamuni, seated on divine lion thrones that arose due to the roots of virtue of those thus-gone ones’ previous actions.

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། རྒྱལ་པོ་དང་། བློན་པོ་དང་། བྲམ་ཟེ་དང་། ཁྱིམ་བདག་རྣམས་ཀྱིས་ནི་ཡོངས་སུ་བསྐོར་ཏེ་ཆོས་སྟོན་ཅིང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དང་ཐབས་ཅིག་ཏུ་ཀུན་ཏུ་སྣང་ངོ་།
en: They were surrounded by all manner of bodhisattvas, gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, kings, ministers, brahmins, and householders, and they taught the Dharma.
